def count_letters(text):
    cnt = {}

    for char in text:
        if char.isalpha():
            char = char.lower()
            if char in cnt:
                cnt[char] += 1
            else:
                cnt[char] = 1

    return cnt


def calculate_frequency(cnt):
    let_sum = sum(cnt.values())
    letter_freq = {}

    for letter, count in cnt.items():
        letter_freq[letter] = count / let_sum

    return letter_freq


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

cnt = count_letters(main_str)
dict_freq = calculate_frequency(cnt)

for char, freq in dict_freq.items():
    print(f"{char}: {freq:.2f}")
